Config/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтветственногоЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ОтветственныеЛицаОрганизаций/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсполняемыеФункции.Добавить("<... все ...>");
	Для Каждого ОтветственноеЛицо Из Перечисления.ОтветственныеЛицаОрганизаций Цикл
		ИсполняемыеФункции.Добавить(ОтветственноеЛицо);
	КонецЦикла;
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		
		ОтборОрганизация = Параметры.Отбор.Организация;
		Параметры.Отбор.Удалить("Организация");
		
	ИначеЕсли Параметры.Свойство("Организация") Тогда
		
		ОтборОрганизация = Параметры.Организация;
		
	Иначе
		
		ОтборОрганизация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию(); 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Организация.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);
	
	Если Параметры.Отбор.Свойство("Подразделение") Тогда
		
		ОтборПодразделение = Параметры.Отбор.Подразделение;
		Параметры.Отбор.Удалить("Подразделение");
		
	ИначеЕсли Параметры.Свойство("Подразделение") Тогда
		
		ОтборПодразделение = Параметры.Подразделение;
		
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("ПодразделениеИспользование", ОтборПодразделениеИспользование) И НЕ Параметры.Свойство("ПодразделениеИспользование", ОтборПодразделениеИспользование) Тогда
	
		ОтборПодразделениеИспользование = ЗначениеЗаполнено(ОтборПодразделение);
		
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подразделение", ОтборПодразделение,,, ОтборПодразделениеИспользование);
	
	Элементы.Подразделение.Видимость = НЕ ОтборПодразделениеИспользование;
	
	НайденноеЗначение = Неопределено;
	
	Если Параметры.Отбор.Свойство("ИсполняемаяФункция") Тогда
		
		НайденноеЗначение = ИсполняемыеФункции.НайтиПоЗначению(Параметры.Отбор.ИсполняемаяФункция);
		Параметры.Отбор.Удалить("ИсполняемаяФункция");
		
	ИначеЕсли Параметры.Свойство("ИсполняемаяФункция") Тогда
		
		НайденноеЗначение = ИсполняемыеФункции.НайтиПоЗначению(Параметры.ИсполняемаяФункция);
		
	КонецЕсли;
	
	Если НайденноеЗначение = Неопределено Тогда
		
		НайденноеЗначение = ИсполняемыеФункции.НайтиПоЗначению("<... все ...>");
		
	КонецЕсли;	 
	
	Элементы.ИсполняемыеФункции.ТекущаяСтрока = НайденноеЗначение.ПолучитьИдентификатор();

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОтветственногоЛица", НайденноеЗначение.Значение,,, НЕ НайденноеЗначение.Значение = "<... все ...>");
    Элементы.ВидОтветственногоЛица.Видимость = НайденноеЗначение.Значение = "<... все ...>";

    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Организация.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подразделение", ОтборПодразделение,,, ЗначениеЗаполнено(ОтборПодразделение));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подразделение", ОтборПодразделение,,, ОтборПодразделениеИспользование);
	Элементы.Подразделение.Видимость = НЕ ОтборПодразделениеИспользование;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеИспользованиеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Подразделение", ОтборПодразделение,,, ОтборПодразделениеИспользование);
	Элементы.Подразделение.Видимость = НЕ ОтборПодразделениеИспользование;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполняемыеФункцииПриАктивизацииСтроки(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидОтветственногоЛица", Элемент.ТекущиеДанные.Значение,,, НЕ Элемент.ТекущиеДанные.Значение = "<... все ...>");
	Элементы.ВидОтветственногоЛица.Видимость = Элемент.ТекущиеДанные.Значение = "<... все ...>";
	
КонецПроцедуры

#КонецОбласти
